-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: May 26, 2017 at 01:57 AM
-- Server version: 10.1.19-MariaDB
-- PHP Version: 5.6.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `yii2_basic_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `detail` text,
  `price` decimal(15,2) NOT NULL,
  `product_type_id` int(11) NOT NULL,
  `amount` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `title`, `detail`, `price`, `product_type_id`, `amount`) VALUES
(1, 'ลิปสติก', 'Wow Long Lasting Lip Color ว้าว ลิปลอก ลิปแทททู เปลี่ยนปากซีดให้เป็นปากสวยแบบธรรมชาติ สวยติดทนนาน 24 ชั่วโมง 1 เซ็ท มี 6 สี (1 เซ็ท)\r\n\r\nเปลี่ยนปากซีดให้เป็นปากสวย สุดชิค เกาหลีสุดๆ สีติดทนนาน ไม่เลอะ ไม่เป็นคราบ สวยธรรมชาติ สีติดทนกว่าเดิม สีสวย เรียบเนียน พร้อมส่ง มาแรงที่สุดในเกาหลีตอนนี้! ติดทน 24ชั่วโมง! จูบ กิน ดื่ม อยู่ทน อยู่นาน ปากสีสวยตลอดวัน Lip tattoo รุ่น WOW สีสวย ว๊ากก ลิปลอกปาก สีเนื้อลิปนุ่ม ติดทนนาน 24 ชม.\r\nลิปสัก สีสวยธรรมชาติมากกก ลอกปุ๊ก...งามเลอค่า..ไม่ต้องไปเจ็บตัว สีติดนานหลายชั่วโมง\r\n6 สี - Lovely Peach, Rose pink, Sweet Orange, Cherry Red, Sexy Red, Watermelon\r\nวิธีใช้ ทาทิ้งไว้ รอให้แห้งซักครู่ จะรู้สึกตึงๆแล้วลอกฟิล์มบางๆออก', '259.00', 2, 1),
(2, 'แป้งฝุ่นผสมชิมเมอร์', 'SKINFOOD Rice Shimmer Powder 23g แป้งฝุ่นผสมชิมเมอร์ แพคเกจใหม่\r\n\r\nคุณสมบัติ\r\nแป้งฝุ่นเนื้อชิมเมอร์ผงมุกละเอียดอ่อน บริสุทธิ์ด้วยคุณค่าของจากข้าว ที่อุดมไปด้วยสารสกัดน้ำมันรำข้าว น้ำนม วิตามินอี ด้วยส่วนผสมที่แตกต่าง ช่วยให้ผิวพรรณสดใส ผิวขาว สว่างเปล่งประกายดุจไข่มุก\r\n\r\nช่วยบำรุงผิว:\r\nด้วยส่วนผสมบริสุทธิ์จากธรรมชาติ ช่วยให้ผิวเนียนนุ่ม สุขภาพดี ช่วยในการกระจายแสงบนใบหน้า และดีต่อสุขภาพ แป้งฝุ่นเนื้อชิมเมอร์ผงมุกละเอียดอ่อน สมบูรณ์แบบ มีประสิทธิผลในทุกด้าน ช่วยในการควบคุมความมัน ปกปิดริ้วรอย ให้สัมผัสอ่อนนุ่มอย่างแท้จริง และอ่อนโยนต่อทุกสภาพผิว ช่วยทำให้การแต่งหน้าดูเนียน เปล่งปลั่ง กระจ่างใสเจิดจ้า ด้วยคุณค่าของข้าว บำรุงผิวให้สุขภาพดีขึ้น\r\n\r\nแพคเกจใหม่ล่าสุดอัพเดทเดือน 4 ปี 2017 ร้อนๆจากเกาหลี SkinFood เกาหลีได้มีการเปลี่ยนแพคเกจของแป้งรุ่นนี้ทั้ง Rice Shimmer Powder และ Buckwheat Loose Powder ให้มีความน่ารักและทันสมัยมากยิ่งขึ้น ดูได้จากรูปด้านล่างนี้', '289.00', 2, 1),
(3, 'เจลเขียนคิ้ว Miracle My Brow 3D ', 'Mei Linda เจลเขียนคิ้ว Miracle My Brow 3D Gel #No2 - Black Brown\r\n\r\nเจลเขียนคิ้วเมลินดา นวัตกรรมใหม่!!\r\nเจลเขียนคิ้วแบบ 3 มิติเขียนง่าย\r\nเนื้อเจลเลื่อน เสมือนคิ้วจริงเป็นธรรมชาติ\r\nเนื้อเนียนติดทนทั้งวัน กันน้ำกันเหงื่อได้ดี ขนาด 3g.\r\nเพิ่มมิติให้กับคิ้วของคุณ ให้สวยดูมีเสน่ห์\r\nมาพร้อมแปรงเขียนคิ้วหัวตัด ใช้ง่าย เนื้อนุ่ม', '144.00', 2, 1),
(4, 'กระทะเคลือบหินอ่อน 8 ชั้น หน้ากว้าง30cm ', 'โดยปกติ การประกอบอาหารประเภทผัดหรือทอด จำเป็นต้องใส่น้ำมันในปริมาณมากๆ เพื่อไม่ให้อาหารติดกระทะ ทำให้อาหารที่ออกมานั้นอมน้ำมันเยอะ ซึ่งอาจส่งผลไม่ดีต่อสุขภาพได้ หากใส่น้ำมันน้อย ก็จะก่อให้เกิดปัญหาอาหารติดกระทะ ไหม้ และล้างออกยาก อาหารที่ได้ก็ไม่น่ารับประทาน \r\n\r\n \r\n\r\nสำหรับผู้ที่ใส่ใจในสุขภาพ คุณมีทางแก้ปัญหายุ่งยากเหล่านี้ด้วย กระทะโคเรียคิง โกล์ดซีรี่ย์ (Korea Wokpan Nano Silver Coating )\r\nกระทะเคลือบหินอ่อนนาโนซิลเวอร์ ที่จะช่วยให้คุณเพลิดเพลินกับการประกอบอาหาร ผัดและทอด โดยไม่ต้องใช้น้ำมัน\r\nอาหารที่ออกมาจะไม่ติดกระทะ น่ารับประทาน\r\n\r\nกระทะโคเรียคิง โกล์ดซีรี่ย์ ผลิตด้วยเทคโนโลยีชั้นสูง และนำเข้าจากสาธารณรัฐเกาหลี เคลือบด้วยชั้นหินอ่อนมากถึง 8 ชั้น ทำให้กระทะมีคุณสมบัติพิเศษ เหนือกว่ากระทะทั่วไป ประกอบด้วย\r\n\r\n \r\n\r\n1. เคลือบชั้นหินอ่อนดำ (Black Marble Coating)\r\n\r\n2. เคลือบชั้นหินอ่อนทอง (Gold Marble Coating)\r\n\r\n3. เคลือบชั้นนาโนซิลเวอร์เงิน (Nano-Silver Marble Coating)\r\n\r\n4. เคลือบชั้นรองพื้นหินอ่อนดำ (Black Marble Base Coating)\r\n\r\n5. เคลือบชั้นรองพื้น ป้องกันอาหารติดกระทะ (Non-Stick Base Coating)\r\n\r\n6. เคลือบผิวชั้นบน (Top Coating)\r\n\r\n7. เคลือบผิวชั้นกลาง (Mid Coating)\r\n\r\n8. เคลือบผิวชั้นแรก (Primer Coating', '790.00', 3, 1),
(5, 'หม้อข้าวตราจระเข้ 28 ซม. ', 'Crocodile หม้อข้าวตราจระเข้ 28 ซม.\r\n\r\nการที่อาหารจะอร่อย นอกจากวัตถุดิบที่สดใหม่บวกกับฝีมือของพ่อครัว แม่ครัวแล้วนั้น\r\nยังจำเป็นต้องมีเครื่องมือคู่ใจที่ช่วยให้การทำอาหารนั้นง่ายขึ้น หม้อข้าวตราจระเข้สองหูอลูมิเนียม \r\nที่มีหูจับหม้อและที่จับฝาหม้อทำจากแบ็กกาไลท์ทนความร้อน ช่วยให้สามารถหยิบจับหม้อได้ง่าย \r\n\r\nรายละเอียดสินค้า\r\n- 1 ฟา 1 หม้อ\r\n- มีหูจับหม้อพิเศษ ทำให้ไม่ร้อนมือ\r\n- ผลิตจากอลูมิเนียม\r\n- แข็งแรง ทนทาน \r\n- SIZE 28 CM.', '349.00', 3, 1),
(6, 'เสื้อนักเรียนชาย', 'เสื้อนักเรียนชาย เป็นเสื้อนักเรียนที่ผลิตด้วยเนื้อผ้าโทเร สีขาว แบบปกคอเชิ๊ต หรือที่เรียกว่า เสื้อเชิ้ตนักเรียนชาย โรงเรียนส่วนมากจะกำหนดให้เด็กนักเรียนใช้เสื้อเชิ๊ตนักเรียนชาย เป็นเครื่องแบบนักเรียน ซึ่งใช้ตั้งแต่ระดับประถมศึกษา จนถึง ระดับมัธยมศึกษาตอนปลาย\r\n\r\nขนาดของเสื้อนักเรียนชาย แบ่งเป็นเบอร์ตามเลขคู่ เริ่มตั้งแต่เบอร์ 28 จนถึง 54 ซึ่งเป็นความยาวรอบตัวเสื้อ โดย size เล็กเริ่มตั้งแต่รอบอก 28 นิ้ว จนถึงขนาด size ใหญ่พิเศษรอบอก 54 นิ้ว\r\n\r\nimage\r\n\r\nลักษณะเสื้อเชิ้ตนักเรียนชาย\r\nเนื้อผ้าโทเรสีขาว ปกคอเชิ้ต (คอแหลม) แขนสั้น\r\nตัวเสื้อผ่าตลอด มีสาบเสื้อ กระดุมสีขาว\r\nกระเป๋า 1 ใบที่หน้าอกด้านซ้าย\r\n\r\n\r\nชุดนักเรียน ตรา FITTER\r\n\r\nชุดนักเรียน หรือ เครื่องแบบนักเรียน FITTER มีวางจำหน่ายในตลาดชุดนักเรียนเป็นเวลายาวนานกว่า 30 ปี\r\n\r\nเครื่องแบบนักเรียนตรา FITTER มีตั้งแต่เครื่องแบบชุดนักเรียนระดับอนุบาล , เครื่องแบบชุดนักเรียนระดับประถมศึกษา และ เครื่องแบบชุดนักเรียนระดับมัธยมศึกษาต้น-มัธยมปลาย โดยมีเครื่องแบบนักเรียนสำหรับเด็กผู้ชาย และสำหรับเด็กผู้หญิง ตั้งแต่เด็กเล็กจนถึงเด็กโต ขนาดรอบตัวเสื้อมีตั้งแต่ size เสื้อรอบตัว 28 นิ้ว จนถึงรอบตัว 52 นิ้ว\r\n\r\nเครื่องแบบนักเรียนตรา FITTER อาทิเช่น เสื้อคอบัวผ่าตลอด , เสื้อคอบัวโปโล , เสื้อนักเรียนชาย , เสื้อปกทหารเรือหญิง , เสื้อมัธยมศึกษาหญิง (มศ ปลาย) , กางเกงนักเรียนชาย สีดำ, สีกากี , สีกรมท่าเข้ม-อ่อน , กระโปรงเด็กนักเรียนหญิง สีกรมท่าเข้ม-อ่อน , กระโปรงนักเรียนมัธยมหญิง 6 จีบ รวมถึง เครื่องแบบชุดลูกเสือ ชุดเนตรนารี และชุดยุวกาชาด เป็นต้น\r\n\r\nimage\r\n\r\nชุดนักเรียน เนื้อผ้าดี ราคาโรงงาน\r\n\r\nเครื่องแบบนักเรียนตรา FITTER มีการคัดเลือกเนื้อผ้าโทเรเทโทรอน จาก บริษัท ไทยโทเร เท็กซ์ไทล์มิลสล์ จำกัด ซึ่งผลิตเนื้อผ้าโทเรที่มีคุณภาพดี ด้วยจำนวนเส้นด้ายที่ใช้ผลิตเนื้อผ้าถึง 220 เส้น ทำให้เนื้อผ้าไม่บาง ไม่ขาดง่าย ผ่านการทดสอบ สวมใส่สบาย สีไม่ตก , และถูกต้องตามแบบกระทรวงศึกษาธิการกำหนด\r\n\r\nสำหรับเสื้อนักเรียนที่เป็นสีขาวคราม มีสีสันที่สวย สดใส ดูใหม่อยู่เสมอ แม้ผ่านการใช้งานนานเป็นปี เนื้อผ้าสีขาวครามยังคงความสดใสยาวนาน\r\n\r\nimage\r\n\r\nFITTER คัดสรรวัสดุคุณภาพ\r\n\r\nชุดนักเรียน FITTER เป็นเครื่องแบบนักเรียน ที่ผลิตและจำหน่ายด้วยความซื่อตรงและจริงใจกับลูกค้า เรามีการออกแบบที่ทันสมัย ใส่แล้วสวยงาม และถูกต้องตามแบบมาตรฐาน\r\n\r\nเรามีความใส่ใจตั้งแต่การคัดเลือกวัสดุที่ใช้ในการผลิต ตั้งแต่ เนื้อผ้าโทเรเทโทรอนเกรด A, เส้นด้ายวีนัสที่มีความเหนียว คงทน ,ซิปวีนัส ที่ใช้งานง่าย ไม่ขึ้นสนิม ไม่ติดขัดเวลารูด , กระดุมเสื้อนักเรียนกที่ผลิตจากเม็ดพลาสติก ทีมีคุณสมบัติ่ทนความร้อนสูง ไม่ละลายเมื่อรีดหรือถูกความร้อน และ ตะขอที่ไม่ขึ้นสนิม เมื่อโดนน้ำ แม้ผ่านการซักเป็นเวลาหลายปี ตลอดจนรายละเอียดการเย็บขึ้นรูปตัวเสื้อนักเรียน , กางเกงนักเรียน หรือกระโปรงนักเรียน ที่คงทน และสวยงาม\r\n\r\nimage\r\n\r\nFITTER ใส่ใจรายละเอียดตัดเย็บ\r\n\r\nเครื่องแบบนักเรียนคุณภาพ ราคาถูก ผลิตจากเนื้อผ้าโทเร เกรด A , เราคัดสรรคุณภาพ ตั้งแต่ เส้นด้าย กระดุม ตลอดจนการตัดเย็บ', '420.00', 5, 3),
(7, 'ผ้าคลุม ทรง A', 'สวยยยย', '500.00', 4, 2);

-- --------------------------------------------------------

--
-- Table structure for table `product_type`
--

CREATE TABLE `product_type` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `product_type`
--

INSERT INTO `product_type` (`id`, `title`) VALUES
(2, 'เครื่องสำอาง'),
(3, 'เครื่องใช้ไฟฟ้า'),
(4, 'ชุดสตรี'),
(5, 'ชุดสุภาพบุรุษ'),
(6, 'อุปกรณ์การเขียน');

-- --------------------------------------------------------

--
-- Table structure for table `webboard_category`
--

CREATE TABLE `webboard_category` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_type_id` (`product_type_id`);

--
-- Indexes for table `product_type`
--
ALTER TABLE `product_type`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `webboard_category`
--
ALTER TABLE `webboard_category`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `product_type`
--
ALTER TABLE `product_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
--
-- AUTO_INCREMENT for table `webboard_category`
--
ALTER TABLE `webboard_category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `product`
--
ALTER TABLE `product`
  ADD CONSTRAINT `product_ibfk_1` FOREIGN KEY (`product_type_id`) REFERENCES `product_type` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
